tap "jurplel/tap"
brew "openssl@3"
brew "python@3.14"
brew "awscli"
brew "ctop"
brew "curl"
brew "ffmpeg"
brew "gh"
brew "git"
brew "gnupg"
brew "htop"
brew "jq"
brew "kubernetes-cli"
brew "lazygit"
brew "llama.cpp"
brew "neovim"
brew "netcat"
brew "nmap"
brew "opencode"
brew "s3cmd"
brew "tmux"
brew "uv"
brew "wget"
cask "1password"
cask "alacritty"
cask "alfred"
cask "bitwarden"
cask "caffeine"
cask "claude"
cask "claude-code"
cask "diffmerge"
cask "ghostty"
cask "google-chrome"
cask "jurplel/tap/instant-space-switcher"
cask "iterm2"
cask "licecap"
cask "localsend"
cask "microsoft-teams"
cask "obs"
cask "obsidian"
cask "spotify"
cask "telegram"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vlc"
cask "whatsapp"
