# =============================================================================
# Brewfile — Managed by dotfiles
# Add packages manually or run: dotfiles-add <brew|cask|mas> <package>
# =============================================================================

# ── Taps ─────────────────────────────────────────────────────────────────────
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "jurplel/tap"
tap "nicoverbruggen/homebrew-cask"

# ── Core CLI tools ────────────────────────────────────────────────────────────
brew "bat"             # cat with syntax highlighting
brew "btop"            # better htop
brew "curl"
brew "dust"            # du but better (disk usage)
brew "eza"             # modern ls replacement
brew "fd"              # fast find
brew "ffmpeg"          # multimedia processing
brew "fzf"             # fuzzy finder
brew "gh"              # GitHub CLI
brew "git"
brew "git-delta"       # better git diffs
brew "gnu-sed"
brew "gzip"
brew "htop"
brew "jq"              # JSON processor
brew "lazygit"         # TUI for git
brew "less"
brew "mkcert"          # local HTTPS certs
brew "neovim"
brew "netcat"          # network utility (nc)
brew "nmap"
brew "openssl"
brew "pidof"
brew "prettyping"
brew "ripgrep"         # blazing fast grep (used by nvim telescope)
brew "rsync"
brew "shellcheck"      # shell script linter
brew "starship"        # cross-shell prompt (alternative to p10k)
brew "stow"            # symlink manager for dotfiles
brew "tldr"            # simplified man pages
brew "tmux"
brew "tree"
brew "unzip"
brew "wget"
brew "yazi"            # terminal file manager
brew "zoxide"          # smarter cd
brew "zsh"

# ── Development ───────────────────────────────────────────────────────────────
brew "asdf"            # multi-language version manager
brew "cmake"
brew "direnv"          # per-directory env vars
brew "llama.cpp"       # local LLM inference
brew "docker-compose"
brew "gcc"
brew "git-lfs"
brew "go"
brew "httpie"          # human-friendly curl
brew "make"
brew "node"
brew "opencode"        # AI coding assistant (CLI)
brew "pnpm"
brew "python@3.14"
brew "rust"
brew "uv"              # fast Python package manager (replaces pip/poetry)
brew "watchman"        # file watching (needed by some dev tools)

# ── Database / infra ─────────────────────────────────────────────────────────
brew "postgresql@16"
brew "redis"
brew "sqlite"

# ── Security / networking ─────────────────────────────────────────────────────
brew "gnupg"
brew "openssh"
brew "sops"            # secret management
brew "age"             # modern encryption tool

# ── Kubernetes / cloud ────────────────────────────────────────────────────────
brew "awscli"          # AWS CLI
brew "ctop"            # container monitoring TUI
brew "helm"
brew "k9s"             # Kubernetes TUI
brew "kubectl"
brew "kubectx"
brew "s3cmd"           # S3 command-line tool

# ── ── ── ── Mac Apps (cask) ── ── ── ── ── ── ── ── ── ── ── ── ── ── ── ──

# Dev tools
cask "alacritty"       # GPU-accelerated terminal
cask "claude-code"     # Claude Code desktop app
cask "cursor"          # AI-powered editor (or use "visual-studio-code")
cask "diffmerge"       # visual diff and merge
cask "iterm2"          # terminal (or ghostty)
cask "ghostty"         # fast GPU terminal
cask "insomnia"        # REST client
cask "proxyman"        # HTTP proxy debugger
cask "tableplus"       # DB GUI
cask "visual-studio-code"

# Productivity
cask "1password"
cask "alfred"
cask "bartender"       # menu bar manager
cask "bitwarden"       # password manager
cask "caffeine"        # prevent sleep
cask "claude"          # Claude desktop app
cask "cleanmymac"
cask "licecap"         # GIF screen recorder
cask "localsend"       # local file sharing
cask "obsidian"        # knowledge base / notes
cask "raycast"         # better Spotlight
cask "superwhisper"    # AI transcription

# Browsers
cask "arc"
cask "firefox"
cask "google-chrome"
cask "brave"

# Communication
cask "microsoft-teams"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "zoom"

# Design
#cask "figma"

# Media
cask "obs"             # screen recording / streaming
cask "spotify"
cask "vlc"             # media player

# System
cask "aerospace"       # tiling window manager (replaces yabai/skhd)
cask "jurplel/tap/instant-space-switcher"  # macOS space switcher
cask "karabiner-elements"  # keyboard remapping
cask "the-unarchiver"  # archive extraction

# Fonts — crucial for terminal / nvim icons
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-fira-code-nerd-font"

# ── Mac App Store ─────────────────────────────────────────────────────────────
# Uncomment and add your MAS IDs (find with: mas search <app>)
# mas "Xcode", id: 497799835
# mas "Things 3", id: 904280696
# mas "Bear", id: 1091189122
